#pragma once

#include <cmath>
#include <vector>

namespace Geometry {

	static const double eps = 1e-8;
	static const double pi = 3.14159265358979323;
	//---------------------------------------------------------------------------
	//*********************** Структуры данных ************************************
	// Точка
	class point
	{
	public:
		double x, y;
		// дополнительный параметр - индекс точки
		int i;
		// Создание точки (_x, _y)
		point(double _x, double _y)
		{
			x = _x;
			y = _y;
		}
		// Создание точки (0, 0)
		point()
		{
			point(0, 0);
		}
	};

	// принадлежит ли точка в многоугольнику?
	bool point_in_polygon(point t, std::vector < point > p);
	//---------------------------------------------------------------------------

};
//---------------------------------------------------------------------------
